app/views/questions/show.html.erb

<ul>
  <% @questions.choices.find_each do |choice| %>
---
SELECT  "choices".* FROM "choices" WHERE "choices"."question_id" = ? ORDER BY "choices"."id" ASC LIMIT ?  [["question_id", 1], ["LIMIT", 1000]]