app/controllers/choices_controller.rb

  def create
    @question = Question.find(params[:questions_path])
    text = params[:text]
    correct = params[:correct] == '1'
    new = Choice.create(:text => text, :correct => correct, :question_id => @question.id)
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "choices" ("text", "correct", "question_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["text", "Programacion"], ["correct", 1], ["question_id", 2], ["created_at", "2018-05-24 06:44:08.995766"], ["updated_at", "2018-05-24 06:44:08.995766"]]

  def destroy
    @question = Question.find(params[:question])
    @choice = Choice.find(params[:choice])
    @choice.destroy
---
SELECT  "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "choices".* FROM "choices" WHERE "choices"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "choices" WHERE "choices"."id" = ?  [["id", 2]]